[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:6:80
 // Allow injection of a SpeechRecognition constructor for testability
 export type SpeechRecognitionFactory = () => any | null;
 
-export const defaultSpeechRecognitionFactory: SpeechRecognitionFactory = () => {
-  if (typeof window !== 'undefined') {
-    return (window as any).SpeechRecognition || (window as any).webkitSpeechRecognition || null;
-  }
-  return null;
-};
+export const defaultSpeechRecognitionFactory: SpeechRecognitionFactory = () => {};
 
 export const useSpeechRecognition = (
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:7:38
 export type SpeechRecognitionFactory = () => any | null;
 
 export const defaultSpeechRecognitionFactory: SpeechRecognitionFactory = () => {
-  if (typeof window !== 'undefined') {
-    return (window as any).SpeechRecognition || (window as any).webkitSpeechRecognition || null;
-  }
+  if (typeof window !== 'undefined') {}
   return null;
 };
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/hooks/useSpeechRecognition.ts:7:7
 export type SpeechRecognitionFactory = () => any | null;
 
 export const defaultSpeechRecognitionFactory: SpeechRecognitionFactory = () => {
-  if (typeof window !== 'undefined') {
+  if (typeof window === 'undefined') {
     return (window as any).SpeechRecognition || (window as any).webkitSpeechRecognition || null;
   }
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/hooks/useSpeechRecognition.ts:8:12
 
 export const defaultSpeechRecognitionFactory: SpeechRecognitionFactory = () => {
   if (typeof window !== 'undefined') {
-    return (window as any).SpeechRecognition || (window as any).webkitSpeechRecognition || null;
+    return false || null;
   }
   return null;
killedBy: defaultSpeechRecognitionFactory returns constructor when window has SpeechRecognition
statusReason: expected null to be [Function Test] // Object.is equality

[Killed] ConditionalExpression
src/hooks/useSpeechRecognition.ts:8:12
 
 export const defaultSpeechRecognitionFactory: SpeechRecognitionFactory = () => {
   if (typeof window !== 'undefined') {
-    return (window as any).SpeechRecognition || (window as any).webkitSpeechRecognition || null;
+    return false;
   }
   return null;
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/hooks/useSpeechRecognition.ts:17:50
   onTranscript: (text: string) => void,
   getSpeechRecognition: SpeechRecognitionFactory = defaultSpeechRecognitionFactory,
 ) => {
-  const [isRecording, setIsRecording] = useState(false);
+  const [isRecording, setIsRecording] = useState(true);
   const [recognition, setRecognition] = useState<any>(null);
 
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/hooks/useSpeechRecognition.ts:22:9
 
   useEffect(() => {
     const SpeechRecognition = getSpeechRecognition();
-    if (SpeechRecognition) {
+    if (false) {
       const recog = new SpeechRecognition();
       recog.continuous = true;
killedBy: useSpeechRecognition injection tests works when factory returns a constructor: start/stop and onerror use latest instance
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/hooks/useSpeechRecognition.ts:22:9
 
   useEffect(() => {
     const SpeechRecognition = getSpeechRecognition();
-    if (SpeechRecognition) {
+    if (true) {
       const recog = new SpeechRecognition();
       recog.continuous = true;
killedBy: useSpeechRecognition edge behaviors toggling when no SpeechRecognition exists does not throw and leaves recording false
statusReason: SpeechRecognition is not a constructor

[Killed] BooleanLiteral
src/hooks/useSpeechRecognition.ts:24:26
     const SpeechRecognition = getSpeechRecognition();
     if (SpeechRecognition) {
       const recog = new SpeechRecognition();
-      recog.continuous = true;
+      recog.continuous = false;
       recog.interimResults = true;
       recog.lang = 'en-US'; // Could be 'ar-EG' if needed
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/hooks/useSpeechRecognition.ts:25:30
     if (SpeechRecognition) {
       const recog = new SpeechRecognition();
       recog.continuous = true;
-      recog.interimResults = true;
+      recog.interimResults = false;
       recog.lang = 'en-US'; // Could be 'ar-EG' if needed
 
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:28:40
       recog.interimResults = true;
       recog.lang = 'en-US'; // Could be 'ar-EG' if needed
 
-      recog.onresult = (event: any) => {
-        let finalTranscript = '';
-        for (let i = event.resultIndex; i < event.results.length; ++i) {
-          if (event.results[i].isFinal) {
-            finalTranscript += event.results[i][0].transcript;
-          }
-        }
-        if (finalTranscript) {
-          onTranscript(finalTranscript);
-        }
-      };
+      recog.onresult = (event: any) => {};
 
       recog.onerror = (event: any) => {
killedBy: useSpeechRecognition injection tests works when factory returns a constructor: start/stop and onerror use latest instance
statusReason: expected "vi.fn()" to be called with arguments: [ 'ok' ]

Number of calls: 0

[Killed] StringLiteral
src/hooks/useSpeechRecognition.ts:29:31
       recog.lang = 'en-US'; // Could be 'ar-EG' if needed
 
       recog.onresult = (event: any) => {
-        let finalTranscript = '';
+        let finalTranscript = "Stryker was here!";
         for (let i = event.resultIndex; i < event.results.length; ++i) {
           if (event.results[i].isFinal) {
killedBy: useSpeechRecognition injection tests works when factory returns a constructor: start/stop and onerror use latest instance
statusReason: expected "vi.fn()" to be called with arguments: [ 'ok' ]

Received:

  1st vi.fn() call:

  [
-   "ok",

[Killed] EqualityOperator
src/hooks/useSpeechRecognition.ts:30:41
 
       recog.onresult = (event: any) => {
         let finalTranscript = '';
-        for (let i = event.resultIndex; i < event.results.length; ++i) {
+        for (let i = event.resultIndex; i >= event.results.length; ++i) {
           if (event.results[i].isFinal) {
             finalTranscript += event.results[i][0].transcript;
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected "vi.fn()" to be called with arguments: [ 'hello' ]

Number of calls: 0

[Killed] UpdateOperator
src/hooks/useSpeechRecognition.ts:30:67
 
       recog.onresult = (event: any) => {
         let finalTranscript = '';
-        for (let i = event.resultIndex; i < event.results.length; ++i) {
+        for (let i = event.resultIndex; i < event.results.length; --i) {
           if (event.results[i].isFinal) {
             finalTranscript += event.results[i][0].transcript;
killedBy: useSpeechRecognition injection tests works when factory returns a constructor: start/stop and onerror use latest instance
statusReason: Cannot read properties of undefined (reading 'isFinal')

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:31:41
       recog.onresult = (event: any) => {
         let finalTranscript = '';
         for (let i = event.resultIndex; i < event.results.length; ++i) {
-          if (event.results[i].isFinal) {
-            finalTranscript += event.results[i][0].transcript;
-          }
+          if (event.results[i].isFinal) {}
         }
         if (finalTranscript) {
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected "vi.fn()" to be called with arguments: [ 'hello' ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/useSpeechRecognition.ts:31:15
       recog.onresult = (event: any) => {
         let finalTranscript = '';
         for (let i = event.resultIndex; i < event.results.length; ++i) {
-          if (event.results[i].isFinal) {
+          if (false) {
             finalTranscript += event.results[i][0].transcript;
           }
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected "vi.fn()" to be called with arguments: [ 'hello' ]

Number of calls: 0

[Killed] AssignmentOperator
src/hooks/useSpeechRecognition.ts:32:13
         let finalTranscript = '';
         for (let i = event.resultIndex; i < event.results.length; ++i) {
           if (event.results[i].isFinal) {
-            finalTranscript += event.results[i][0].transcript;
+            finalTranscript -= event.results[i][0].transcript;
           }
         }
killedBy: useSpeechRecognition injection tests works when factory returns a constructor: start/stop and onerror use latest instance
statusReason: expected "vi.fn()" to be called with arguments: [ 'ok' ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/useSpeechRecognition.ts:35:13
             finalTranscript += event.results[i][0].transcript;
           }
         }
-        if (finalTranscript) {
+        if (true) {
           onTranscript(finalTranscript);
         }
killedBy: useSpeechRecognition edge behaviors does not call onTranscript for interim (non-final) results
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "",

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:35:30
             finalTranscript += event.results[i][0].transcript;
           }
         }
-        if (finalTranscript) {
-          onTranscript(finalTranscript);
-        }
+        if (finalTranscript) {}
       };
 
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected "vi.fn()" to be called with arguments: [ 'hello' ]

Number of calls: 0

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:40:39
         }
       };
 
-      recog.onerror = (event: any) => {
-        console.error('Speech recognition error', event.error);
-        setIsRecording(false);
-      };
+      recog.onerror = (event: any) => {};
 
       recog.onend = () => {
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] BooleanLiteral
src/hooks/useSpeechRecognition.ts:42:24
 
       recog.onerror = (event: any) => {
         console.error('Speech recognition error', event.error);
-        setIsRecording(false);
+        setIsRecording(true);
       };
 
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:45:27
         setIsRecording(false);
       };
 
-      recog.onend = () => {
-        setIsRecording(false);
-      };
+      recog.onend = () => {};
 
       setRecognition(recog);
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] BooleanLiteral
src/hooks/useSpeechRecognition.ts:46:24
       };
 
       recog.onend = () => {
-        setIsRecording(false);
+        setIsRecording(true);
       };
 
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:50:12
       };
 
       setRecognition(recog);
-    } else {
-      // ensure no recognition is set when factory returns null
-      setRecognition(null);
-    }
+    } else {}
   }, [onTranscript, getSpeechRecognition]);
 
killedBy: useSpeechRecognition injection tests clears recognition when factory changes from constructor to null
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:56:44
     }
   }, [onTranscript, getSpeechRecognition]);
 
-  const startRecording = useCallback(() => {
-    try {
-      // optional chaining to safely call start when recognition exists
-      recognition?.start();
-      // set recording only if a recognition instance exists
-      setIsRecording(Boolean(recognition));
-    } catch (e) {
-      console.error(e);
-    }
-  }, [recognition]);
+  const startRecording = useCallback(() => {}, [recognition]);
 
   const stopRecording = useCallback(() => {
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:57:9
   }, [onTranscript, getSpeechRecognition]);
 
   const startRecording = useCallback(() => {
-    try {
-      // optional chaining to safely call start when recognition exists
-      recognition?.start();
-      // set recording only if a recognition instance exists
-      setIsRecording(Boolean(recognition));
-    } catch (e) {
+    try {} catch (e) {
       console.error(e);
     }
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected "vi.fn()" to be called at least once

[Killed] OptionalChaining
src/hooks/useSpeechRecognition.ts:59:7
   const startRecording = useCallback(() => {
     try {
       // optional chaining to safely call start when recognition exists
-      recognition?.start();
+      recognition.start();
       // set recording only if a recognition instance exists
       setIsRecording(Boolean(recognition));
killedBy: useSpeechRecognition injection tests works when factory returns null: isSupported false and toggling is safe (no errors logged)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      [TypeError: Cannot read properties of null (reading 'start')],

[NoCoverage] BlockStatement
src/hooks/useSpeechRecognition.ts:62:17
       recognition?.start();
       // set recording only if a recognition instance exists
       setIsRecording(Boolean(recognition));
-    } catch (e) {
-      console.error(e);
-    }
+    } catch (e) {}
   }, [recognition]);
 

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:67:43
     }
   }, [recognition]);
 
-  const stopRecording = useCallback(() => {
-    try {
-      // safely call stop if available
-      recognition?.stop();
-    } catch (e) {
-      console.error(e);
-    } finally {
-      // always ensure the recording flag is cleared
-      setIsRecording(false);
-    }
-  }, [recognition]);
+  const stopRecording = useCallback(() => {}, [recognition]);
 
   const toggleRecording = useCallback(() => {
killedBy: useSpeechRecognition edge behaviors recreates recognition when onTranscript callback changes and stop uses latest instance
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:68:9
   }, [recognition]);
 
   const stopRecording = useCallback(() => {
-    try {
-      // safely call stop if available
-      recognition?.stop();
-    } catch (e) {
+    try {} catch (e) {
       console.error(e);
     } finally {
killedBy: useSpeechRecognition edge behaviors recreates recognition when onTranscript callback changes and stop uses latest instance
statusReason: expected "vi.fn()" to be called at least once

[Killed] OptionalChaining
src/hooks/useSpeechRecognition.ts:70:7
   const stopRecording = useCallback(() => {
     try {
       // safely call stop if available
-      recognition?.stop();
+      recognition.stop();
     } catch (e) {
       console.error(e);
killedBy: useSpeechRecognition extra behaviors does not throw when recognition disappears while recording and toggled to stop
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      [TypeError: Cannot read properties of null (reading 'stop')],

[NoCoverage] BlockStatement
src/hooks/useSpeechRecognition.ts:71:17
     try {
       // safely call stop if available
       recognition?.stop();
-    } catch (e) {
-      console.error(e);
-    } finally {
+    } catch (e) {} finally {
       // always ensure the recording flag is cleared
       setIsRecording(false);

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:73:15
       recognition?.stop();
     } catch (e) {
       console.error(e);
-    } finally {
-      // always ensure the recording flag is cleared
-      setIsRecording(false);
-    }
+    } finally {}
   }, [recognition]);
 
killedBy: useSpeechRecognition injection tests works when factory returns a constructor: start/stop and onerror use latest instance
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] BooleanLiteral
src/hooks/useSpeechRecognition.ts:75:22
       console.error(e);
     } finally {
       // always ensure the recording flag is cleared
-      setIsRecording(false);
+      setIsRecording(true);
     }
   }, [recognition]);
killedBy: useSpeechRecognition injection tests works when factory returns a constructor: start/stop and onerror use latest instance
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:79:45
     }
   }, [recognition]);
 
-  const toggleRecording = useCallback(() => {
-    if (isRecording) {
-      stopRecording();
-    } else {
-      startRecording();
-    }
-  }, [isRecording, startRecording, stopRecording]);
+  const toggleRecording = useCallback(() => {}, [isRecording, startRecording, stopRecording]);
 
   return { isRecording, toggleRecording, isSupported: !!recognition };
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/hooks/useSpeechRecognition.ts:80:9
   }, [recognition]);
 
   const toggleRecording = useCallback(() => {
-    if (isRecording) {
+    if (true) {
       stopRecording();
     } else {
killedBy: useSpeechRecognition injection tests works when factory returns a constructor: start/stop and onerror use latest instance
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/hooks/useSpeechRecognition.ts:80:9
   }, [recognition]);
 
   const toggleRecording = useCallback(() => {
-    if (isRecording) {
+    if (false) {
       stopRecording();
     } else {
killedBy: useSpeechRecognition edge behaviors recreates recognition when onTranscript callback changes and stop uses latest instance
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/hooks/useSpeechRecognition.ts:82:12
   const toggleRecording = useCallback(() => {
     if (isRecording) {
       stopRecording();
-    } else {
-      startRecording();
-    }
+    } else {}
   }, [isRecording, startRecording, stopRecording]);
 
killedBy: useSpeechRecognition edge behaviors sets recognition props (continuous/interimResults/lang) and handles onresult/onerror/onend
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrayDeclaration
src/hooks/useSpeechRecognition.ts:85:6
     } else {
       startRecording();
     }
-  }, [isRecording, startRecording, stopRecording]);
+  }, []);
 
   return { isRecording, toggleRecording, isSupported: !!recognition };
killedBy: useSpeechRecognition injection tests works when factory returns a constructor: start/stop and onerror use latest instance
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/hooks/useSpeechRecognition.ts:87:55
     }
   }, [isRecording, startRecording, stopRecording]);
 
-  return { isRecording, toggleRecording, isSupported: !!recognition };
+  return { isRecording, toggleRecording, isSupported: !recognition };
 };
 
killedBy: useSpeechRecognition injection tests works when factory returns null: isSupported false and toggling is safe (no errors logged)
statusReason: expected 'true' to be 'false' // Object.is equality
