[Killed] BlockStatement
src/format.ts:1:55
-export function formatUser(name: string, age: number) {
-  return { name, age, active: true };
-}
+export function formatUser(name: string, age: number) {}
 
killedBy: targeted survivor tests formatUser returns active flag and preserves fields
statusReason: Cannot convert undefined or null to object

[Killed] BooleanLiteral
src/format.ts:2:31
 export function formatUser(name: string, age: number) {
-  return { name, age, active: true };
+  return { name, age, active: false };
 }
 
killedBy: targeted survivor tests formatUser returns active flag and preserves fields
statusReason: expected { name: 'Eve', age: 40, active: false } to have property "active" with value true
