[Killed] BlockStatement
src/async.ts:1:68
-export async function fetchData<T>(value: T): Promise<{ data: T }> {
-  // simulate async work
-  return new Promise((resolve) => setTimeout(() => resolve({ data: value }), 5));
-}
+export async function fetchData<T>(value: T): Promise<{ data: T }> {}
 
killedBy: targeted survivor tests fetchData returns same value for primitives and deep-equal for objects
statusReason: expected undefined to deeply equal { data: 'x' }

[Killed] ArrowFunction
src/async.ts:3:22
 export async function fetchData<T>(value: T): Promise<{ data: T }> {
   // simulate async work
-  return new Promise((resolve) => setTimeout(() => resolve({ data: value }), 5));
+  return new Promise(() => undefined);
 }
 
killedBy: targeted survivor tests fetchData returns same value for primitives and deep-equal for objects
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/async.ts:3:46
 export async function fetchData<T>(value: T): Promise<{ data: T }> {
   // simulate async work
-  return new Promise((resolve) => setTimeout(() => resolve({ data: value }), 5));
+  return new Promise((resolve) => setTimeout(() => undefined, 5));
 }
 
killedBy: targeted survivor tests fetchData returns same value for primitives and deep-equal for objects
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
