[Killed] BlockStatement
src/hooks/useAudioAlert.ts:3:129
 import { useEffect, useRef } from 'react';
 
-export function useAudioAlert(trigger: boolean, audioUrl = 'https://assets.mixkit.co/active_storage/sfx/2869/2869-preview.mp3') {
-  const audioRef = useRef<HTMLAudioElement | null>(null);
-
-  useEffect(() => {
-    if (!audioRef.current) {
-      audioRef.current = new Audio(audioUrl);
-    }
-    
-    if (trigger) {
-      audioRef.current.play().catch(e => console.log('Audio play prevented by browser policy', e));
-    }
-  }, [trigger, audioUrl]);
-}
+export function useAudioAlert(trigger: boolean, audioUrl = 'https://assets.mixkit.co/active_storage/sfx/2869/2869-preview.mp3') {}
 
killedBy: useAudioAlert edge behaviors constructs Audio with default URL and plays when trigger true
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/hooks/useAudioAlert.ts:3:60
 import { useEffect, useRef } from 'react';
 
-export function useAudioAlert(trigger: boolean, audioUrl = 'https://assets.mixkit.co/active_storage/sfx/2869/2869-preview.mp3') {
+export function useAudioAlert(trigger: boolean, audioUrl = "") {
   const audioRef = useRef<HTMLAudioElement | null>(null);
 
killedBy: useAudioAlert edge behaviors constructs Audio with default URL and plays when trigger true
statusReason: expected '' to contain 'mixkit'

[Killed] BlockStatement
src/hooks/useAudioAlert.ts:6:19
 export function useAudioAlert(trigger: boolean, audioUrl = 'https://assets.mixkit.co/active_storage/sfx/2869/2869-preview.mp3') {
   const audioRef = useRef<HTMLAudioElement | null>(null);
 
-  useEffect(() => {
-    if (!audioRef.current) {
-      audioRef.current = new Audio(audioUrl);
-    }
-    
-    if (trigger) {
-      audioRef.current.play().catch(e => console.log('Audio play prevented by browser policy', e));
-    }
-  }, [trigger, audioUrl]);
+  useEffect(() => {}, [trigger, audioUrl]);
 }
 
killedBy: useAudioAlert edge behaviors constructs Audio with default URL and plays when trigger true
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/hooks/useAudioAlert.ts:7:9
   const audioRef = useRef<HTMLAudioElement | null>(null);
 
   useEffect(() => {
-    if (!audioRef.current) {
+    if (true) {
       audioRef.current = new Audio(audioUrl);
     }
killedBy: useAudioAlert edge behaviors constructs Audio only once across multiple renders and re-triggers
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/hooks/useAudioAlert.ts:7:28
   const audioRef = useRef<HTMLAudioElement | null>(null);
 
   useEffect(() => {
-    if (!audioRef.current) {
-      audioRef.current = new Audio(audioUrl);
-    }
+    if (!audioRef.current) {}
     
     if (trigger) {
killedBy: useAudioAlert edge behaviors constructs Audio with default URL and plays when trigger true
statusReason: Cannot read properties of null (reading 'play')

[Killed] BlockStatement
src/hooks/useAudioAlert.ts:11:18
       audioRef.current = new Audio(audioUrl);
     }
     
-    if (trigger) {
-      audioRef.current.play().catch(e => console.log('Audio play prevented by browser policy', e));
-    }
+    if (trigger) {}
   }, [trigger, audioUrl]);
 }
killedBy: useAudioAlert edge behaviors constructs Audio with default URL and plays when trigger true
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/hooks/useAudioAlert.ts:11:9
       audioRef.current = new Audio(audioUrl);
     }
     
-    if (trigger) {
+    if (false) {
       audioRef.current.play().catch(e => console.log('Audio play prevented by browser policy', e));
     }
killedBy: useAudioAlert edge behaviors constructs Audio with default URL and plays when trigger true
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrowFunction
src/hooks/useAudioAlert.ts:12:37
     }
     
     if (trigger) {
-      audioRef.current.play().catch(e => console.log('Audio play prevented by browser policy', e));
+      audioRef.current.play().catch(() => undefined);
     }
   }, [trigger, audioUrl]);
killedBy: useAudioAlert edge behaviors logs a message when play rejects
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
src/hooks/useAudioAlert.ts:12:54
     }
     
     if (trigger) {
-      audioRef.current.play().catch(e => console.log('Audio play prevented by browser policy', e));
+      audioRef.current.play().catch(e => console.log("", e));
     }
   }, [trigger, audioUrl]);
killedBy: useAudioAlert edge behaviors logs a message when play rejects
statusReason: expected false to be true // Object.is equality
