[Killed] EqualityOperator
src/lib/db.ts:13:5
 
 let dbPromise: Promise<IDBPDatabase<ReferralDB>> | null = null;
 
-if (typeof window !== 'undefined') {
+if (typeof window === 'undefined') {
   dbPromise = openDB<ReferralDB>('referral-store', 1, {
     upgrade(db) {
killedBy: db edge cases returns [] and no-ops when window is undefined
statusReason: indexedDB is not defined

[Killed] StringLiteral
src/lib/db.ts:14:34
 let dbPromise: Promise<IDBPDatabase<ReferralDB>> | null = null;
 
 if (typeof window !== 'undefined') {
-  dbPromise = openDB<ReferralDB>('referral-store', 1, {
+  dbPromise = openDB<ReferralDB>("", 1, {
     upgrade(db) {
       db.createObjectStore('offline-referrals', { keyPath: 'id' });
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: unexpected db name:

[Killed] ObjectLiteral
src/lib/db.ts:14:55
 let dbPromise: Promise<IDBPDatabase<ReferralDB>> | null = null;
 
 if (typeof window !== 'undefined') {
-  dbPromise = openDB<ReferralDB>('referral-store', 1, {
-    upgrade(db) {
-      db.createObjectStore('offline-referrals', { keyPath: 'id' });
-    },
-  });
+  dbPromise = openDB<ReferralDB>('referral-store', 1, {});
 }
 
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: missing upgrade function

[Killed] BlockStatement
src/lib/db.ts:15:17
 
 if (typeof window !== 'undefined') {
   dbPromise = openDB<ReferralDB>('referral-store', 1, {
-    upgrade(db) {
-      db.createObjectStore('offline-referrals', { keyPath: 'id' });
-    },
+    upgrade(db) {},
   });
 }
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: offline-referrals store not created as expected

[Killed] StringLiteral
src/lib/db.ts:16:60
 if (typeof window !== 'undefined') {
   dbPromise = openDB<ReferralDB>('referral-store', 1, {
     upgrade(db) {
-      db.createObjectStore('offline-referrals', { keyPath: 'id' });
+      db.createObjectStore('offline-referrals', { keyPath: "" });
     },
   });
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: offline-referrals store not created as expected

[Killed] BlockStatement
src/lib/db.ts:21:63
   });
 }
 
-export async function saveOfflineReferral(referral: Referral) {
-  if (!dbPromise) return;
-  const db = await dbPromise;
-  await db.put('offline-referrals', referral);
-}
+export async function saveOfflineReferral(referral: Referral) {}
 
 export async function getOfflineReferrals(): Promise<Referral[]> {
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: expected "vi.fn()" to be called with arguments: [ 'offline-referrals', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/db.ts:22:7
 }
 
 export async function saveOfflineReferral(referral: Referral) {
-  if (!dbPromise) return;
+  if (true) return;
   const db = await dbPromise;
   await db.put('offline-referrals', referral);
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: expected "vi.fn()" to be called with arguments: [ 'offline-referrals', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/db.ts:22:7
 }
 
 export async function saveOfflineReferral(referral: Referral) {
-  if (!dbPromise) return;
+  if (false) return;
   const db = await dbPromise;
   await db.put('offline-referrals', referral);
killedBy: db edge cases returns [] and no-ops when window is undefined
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] StringLiteral
src/lib/db.ts:24:16
 export async function saveOfflineReferral(referral: Referral) {
   if (!dbPromise) return;
   const db = await dbPromise;
-  await db.put('offline-referrals', referral);
+  await db.put("", referral);
 }
 
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: expected "vi.fn()" to be called with arguments: [ 'offline-referrals', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "offline-referrals",

[Killed] BlockStatement
src/lib/db.ts:27:66
   await db.put('offline-referrals', referral);
 }
 
-export async function getOfflineReferrals(): Promise<Referral[]> {
-  if (!dbPromise) return [];
-  const db = await dbPromise;
-  return db.getAll('offline-referrals');
-}
+export async function getOfflineReferrals(): Promise<Referral[]> {}
 
 export async function deleteOfflineReferral(id: string) {
killedBy: db edge cases returns [] and no-ops when window is undefined
statusReason: expected undefined to deeply equal []

[Killed] BooleanLiteral
src/lib/db.ts:28:7
 }
 
 export async function getOfflineReferrals(): Promise<Referral[]> {
-  if (!dbPromise) return [];
+  if (dbPromise) return [];
   const db = await dbPromise;
   return db.getAll('offline-referrals');
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: expected "vi.fn()" to be called with arguments: [ 'offline-referrals' ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/db.ts:28:7
 }
 
 export async function getOfflineReferrals(): Promise<Referral[]> {
-  if (!dbPromise) return [];
+  if (false) return [];
   const db = await dbPromise;
   return db.getAll('offline-referrals');
killedBy: db edge cases returns [] and no-ops when window is undefined
statusReason: Cannot read properties of null (reading 'getAll')

[Killed] BlockStatement
src/lib/db.ts:33:57
   return db.getAll('offline-referrals');
 }
 
-export async function deleteOfflineReferral(id: string) {
-  if (!dbPromise) return;
-  const db = await dbPromise;
-  await db.delete('offline-referrals', id);
-}
+export async function deleteOfflineReferral(id: string) {}
 
 export async function clearOfflineReferrals() {
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: expected "vi.fn()" to be called with arguments: [ 'offline-referrals', 'r1' ]

Number of calls: 0

[Killed] BooleanLiteral
src/lib/db.ts:34:7
 }
 
 export async function deleteOfflineReferral(id: string) {
-  if (!dbPromise) return;
+  if (dbPromise) return;
   const db = await dbPromise;
   await db.delete('offline-referrals', id);
killedBy: db edge cases returns [] and no-ops when window is undefined
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] ConditionalExpression
src/lib/db.ts:34:7
 }
 
 export async function deleteOfflineReferral(id: string) {
-  if (!dbPromise) return;
+  if (false) return;
   const db = await dbPromise;
   await db.delete('offline-referrals', id);
killedBy: db edge cases returns [] and no-ops when window is undefined
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] BlockStatement
src/lib/db.ts:39:47
   await db.delete('offline-referrals', id);
 }
 
-export async function clearOfflineReferrals() {
-  if (!dbPromise) return;
-  const db = await dbPromise;
-  await db.clear('offline-referrals');
-}
+export async function clearOfflineReferrals() {}
 
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: expected "vi.fn()" to be called with arguments: [ 'offline-referrals' ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/db.ts:40:7
 }
 
 export async function clearOfflineReferrals() {
-  if (!dbPromise) return;
+  if (false) return;
   const db = await dbPromise;
   await db.clear('offline-referrals');
killedBy: db edge cases returns [] and no-ops when window is undefined
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] ConditionalExpression
src/lib/db.ts:40:7
 }
 
 export async function clearOfflineReferrals() {
-  if (!dbPromise) return;
+  if (true) return;
   const db = await dbPromise;
   await db.clear('offline-referrals');
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: expected "vi.fn()" to be called with arguments: [ 'offline-referrals' ]

Number of calls: 0

[Killed] StringLiteral
src/lib/db.ts:42:18
 export async function clearOfflineReferrals() {
   if (!dbPromise) return;
   const db = await dbPromise;
-  await db.clear('offline-referrals');
+  await db.clear("");
 }
 
killedBy: lib/db (indexedDB wrappers) save/get/delete/clear offline referrals using mocked idb
statusReason: expected "vi.fn()" to be called with arguments: [ 'offline-referrals' ]

Received:

  1st vi.fn() call:

  [
-   "offline-referrals",
