[Killed] BlockStatement
src/lib/utils.ts:8:51
   return twMerge(clsx(inputs));
 }
 
-export function formatDateTime(isoString: string) {
-  const date = new Date(isoString);
-  return new Intl.DateTimeFormat('en-GB', {
-    day: '2-digit',
-    month: 'short',
-    year: 'numeric',
-    hour: '2-digit',
-    minute: '2-digit',
-  }).format(date);
-}
+export function formatDateTime(isoString: string) {}
 
killedBy: lib/utils formatDateTime returns a formatted string containing month short name and year
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] ObjectLiteral
src/lib/utils.ts:10:43
 
 export function formatDateTime(isoString: string) {
   const date = new Date(isoString);
-  return new Intl.DateTimeFormat('en-GB', {
-    day: '2-digit',
-    month: 'short',
-    year: 'numeric',
-    hour: '2-digit',
-    minute: '2-digit',
-  }).format(date);
+  return new Intl.DateTimeFormat('en-GB', {}).format(date);
 }
 
killedBy: lib/utils formatDateTime returns a formatted string containing month short name and year
statusReason: expected '02/01/2020' to contain 'Jan'

[Killed] StringLiteral
src/lib/utils.ts:11:10
 export function formatDateTime(isoString: string) {
   const date = new Date(isoString);
   return new Intl.DateTimeFormat('en-GB', {
-    day: '2-digit',
+    day: "",
     month: 'short',
     year: 'numeric',
killedBy: lib/utils formatDateTime returns a formatted string containing month short name and year
statusReason: Value  out of range for Intl.DateTimeFormat options property day
