[Killed] BlockStatement
src/multiply.ts:1:48
-export function multiply(a: number, b: number) {
-  return a * b;
-}
+export function multiply(a: number, b: number) {}
 
killedBy: targeted survivor tests distributive and Infinity/NaN behavior
statusReason: Distributive failed for a=0,b=0,c=0: lhs=undefined rhs=NaN

[Killed] ArithmeticOperator
src/multiply.ts:2:10
 export function multiply(a: number, b: number) {
-  return a * b;
+  return a / b;
 }
 
killedBy: targeted survivor tests distributive and Infinity/NaN behavior
statusReason: Distributive failed for a=0,b=0,c=2: lhs=0 rhs=NaN
