[Killed] BlockStatement
src/sum.ts:1:43
-export function sum(a: number, b: number) {
-  return a + b;
-}
+export function sum(a: number, b: number) {}
 
killedBy: targeted survivor tests distributive and Infinity/NaN behavior
statusReason: Distributive failed for a=0,b=0,c=0: lhs=NaN rhs=undefined

[Killed] ArithmeticOperator
src/sum.ts:2:10
 export function sum(a: number, b: number) {
-  return a + b;
+  return a - b;
 }
 
killedBy: targeted survivor tests associativity for integers in small range
statusReason: expected 5 to be -5 // Object.is equality
