[NoCoverage] BooleanLiteral
src/hooks/useSpeechRecognition.ts:4:50
 import { useState, useEffect, useCallback } from 'react';
 
 export const useSpeechRecognition = (onTranscript: (text: string) => void) => {
-  const [isRecording, setIsRecording] = useState(false);
+  const [isRecording, setIsRecording] = useState(true);
   const [recognition, setRecognition] = useState<any>(null);
 

[NoCoverage] ConditionalExpression
src/hooks/useSpeechRecognition.ts:9:33
 
   useEffect(() => {
     if (typeof window !== 'undefined') {
-      const SpeechRecognition = (window as any).SpeechRecognition || (window as any).webkitSpeechRecognition;
+      const SpeechRecognition = true;
       if (SpeechRecognition) {
         const recog = new SpeechRecognition();

[NoCoverage] LogicalOperator
src/hooks/useSpeechRecognition.ts:9:33
 
   useEffect(() => {
     if (typeof window !== 'undefined') {
-      const SpeechRecognition = (window as any).SpeechRecognition || (window as any).webkitSpeechRecognition;
+      const SpeechRecognition = (window as any).SpeechRecognition && (window as any).webkitSpeechRecognition;
       if (SpeechRecognition) {
         const recog = new SpeechRecognition();

[NoCoverage] ConditionalExpression
src/hooks/useSpeechRecognition.ts:10:11
   useEffect(() => {
     if (typeof window !== 'undefined') {
       const SpeechRecognition = (window as any).SpeechRecognition || (window as any).webkitSpeechRecognition;
-      if (SpeechRecognition) {
+      if (true) {
         const recog = new SpeechRecognition();
         recog.continuous = true;

[NoCoverage] ConditionalExpression
src/hooks/useSpeechRecognition.ts:10:11
   useEffect(() => {
     if (typeof window !== 'undefined') {
       const SpeechRecognition = (window as any).SpeechRecognition || (window as any).webkitSpeechRecognition;
-      if (SpeechRecognition) {
+      if (false) {
         const recog = new SpeechRecognition();
         recog.continuous = true;

[NoCoverage] StringLiteral
src/hooks/useSpeechRecognition.ts:14:22
         const recog = new SpeechRecognition();
         recog.continuous = true;
         recog.interimResults = true;
-        recog.lang = 'en-US'; // Could be 'ar-EG' if needed, assuming english or english/arabic
+        recog.lang = ""; // Could be 'ar-EG' if needed, assuming english or english/arabic
 
         recog.onresult = (event: any) => {

[NoCoverage] BlockStatement
src/hooks/useSpeechRecognition.ts:18:74
 
         recog.onresult = (event: any) => {
           let finalTranscript = '';
-          for (let i = event.resultIndex; i < event.results.length; ++i) {
-            if (event.results[i].isFinal) {
-              finalTranscript += event.results[i][0].transcript;
-            }
-          }
+          for (let i = event.resultIndex; i < event.results.length; ++i) {}
           if (finalTranscript) {
             onTranscript(finalTranscript);

[NoCoverage] ConditionalExpression
src/hooks/useSpeechRecognition.ts:19:17
         recog.onresult = (event: any) => {
           let finalTranscript = '';
           for (let i = event.resultIndex; i < event.results.length; ++i) {
-            if (event.results[i].isFinal) {
+            if (true) {
               finalTranscript += event.results[i][0].transcript;
             }

[NoCoverage] ConditionalExpression
src/hooks/useSpeechRecognition.ts:23:15
               finalTranscript += event.results[i][0].transcript;
             }
           }
-          if (finalTranscript) {
+          if (false) {
             onTranscript(finalTranscript);
           }

[NoCoverage] StringLiteral
src/hooks/useSpeechRecognition.ts:29:25
         };
 
         recog.onerror = (event: any) => {
-          console.error('Speech recognition error', event.error);
+          console.error("", event.error);
           setIsRecording(false);
         };

[NoCoverage] ArrayDeclaration
src/hooks/useSpeechRecognition.ts:40:6
         setRecognition(recog);
       }
     }
-  }, [onTranscript]);
+  }, []);
 
   const startRecording = useCallback(() => {

[NoCoverage] BlockStatement
src/hooks/useSpeechRecognition.ts:42:44
     }
   }, [onTranscript]);
 
-  const startRecording = useCallback(() => {
-    if (recognition) {
-      try {
-        recognition.start();
-        setIsRecording(true);
-      } catch (e) {
-        console.error(e);
-      }
-    }
-  }, [recognition]);
+  const startRecording = useCallback(() => {}, [recognition]);
 
   const stopRecording = useCallback(() => {

[NoCoverage] ConditionalExpression
src/hooks/useSpeechRecognition.ts:43:9
   }, [onTranscript]);
 
   const startRecording = useCallback(() => {
-    if (recognition) {
+    if (true) {
       try {
         recognition.start();

[NoCoverage] ConditionalExpression
src/hooks/useSpeechRecognition.ts:43:9
   }, [onTranscript]);
 
   const startRecording = useCallback(() => {
-    if (recognition) {
+    if (false) {
       try {
         recognition.start();

[NoCoverage] BlockStatement
src/hooks/useSpeechRecognition.ts:44:11
 
   const startRecording = useCallback(() => {
     if (recognition) {
-      try {
-        recognition.start();
-        setIsRecording(true);
-      } catch (e) {
+      try {} catch (e) {
         console.error(e);
       }

[NoCoverage] BooleanLiteral
src/hooks/useSpeechRecognition.ts:46:24
     if (recognition) {
       try {
         recognition.start();
-        setIsRecording(true);
+        setIsRecording(false);
       } catch (e) {
         console.error(e);

[NoCoverage] BlockStatement
src/hooks/useSpeechRecognition.ts:47:19
       try {
         recognition.start();
         setIsRecording(true);
-      } catch (e) {
-        console.error(e);
-      }
+      } catch (e) {}
     }
   }, [recognition]);

[NoCoverage] BlockStatement
src/hooks/useSpeechRecognition.ts:53:43
     }
   }, [recognition]);
 
-  const stopRecording = useCallback(() => {
-    if (recognition) {
-      recognition.stop();
-      setIsRecording(false);
-    }
-  }, [recognition]);
+  const stopRecording = useCallback(() => {}, [recognition]);
 
   const toggleRecording = useCallback(() => {

[NoCoverage] ConditionalExpression
src/hooks/useSpeechRecognition.ts:54:9
   }, [recognition]);
 
   const stopRecording = useCallback(() => {
-    if (recognition) {
+    if (true) {
       recognition.stop();
       setIsRecording(false);

[NoCoverage] BlockStatement
src/hooks/useSpeechRecognition.ts:54:22
   }, [recognition]);
 
   const stopRecording = useCallback(() => {
-    if (recognition) {
-      recognition.stop();
-      setIsRecording(false);
-    }
+    if (recognition) {}
   }, [recognition]);
 

[NoCoverage] BooleanLiteral
src/hooks/useSpeechRecognition.ts:56:22
   const stopRecording = useCallback(() => {
     if (recognition) {
       recognition.stop();
-      setIsRecording(false);
+      setIsRecording(true);
     }
   }, [recognition]);
