[NoCoverage] StringLiteral
src/lib/mock-data.ts:9:32
     name: 'Ismailia General Hospital', 
     type: 'tertiary_care', 
     location: 'Ismailia City',
-    departments: ['Emergency', 'ICU', 'CCU', 'PICU', 'Cardiology', 'Neurology', 'Surgery', 'Pediatrics', 'Internal Medicine'],
+    departments: ['Emergency', "", 'CCU', 'PICU', 'Cardiology', 'Neurology', 'Surgery', 'Pediatrics', 'Internal Medicine'],
     capacity: {
       ICU: { total: 20, occupied: 18 },

[NoCoverage] StringLiteral
src/lib/mock-data.ts:9:54
     name: 'Ismailia General Hospital', 
     type: 'tertiary_care', 
     location: 'Ismailia City',
-    departments: ['Emergency', 'ICU', 'CCU', 'PICU', 'Cardiology', 'Neurology', 'Surgery', 'Pediatrics', 'Internal Medicine'],
+    departments: ['Emergency', 'ICU', 'CCU', 'PICU', "", 'Neurology', 'Surgery', 'Pediatrics', 'Internal Medicine'],
     capacity: {
       ICU: { total: 20, occupied: 18 },

[NoCoverage] ObjectLiteral
src/lib/mock-data.ts:13:13
     capacity: {
       ICU: { total: 20, occupied: 18 },
       CCU: { total: 10, occupied: 9 },
-      PICU: { total: 8, occupied: 5 },
+      PICU: {},
       Ward: { total: 200, occupied: 150 }
     }

[NoCoverage] StringLiteral
src/lib/mock-data.ts:22:19
     name: 'Tel El Kebir District Hospital', 
     type: 'district_hospital', 
     location: 'Tel El Kebir',
-    departments: ['Emergency', 'ICU', 'Surgery', 'Internal Medicine', 'Pediatrics'],
+    departments: ["", 'ICU', 'Surgery', 'Internal Medicine', 'Pediatrics'],
     capacity: {
       ICU: { total: 8, occupied: 8 },

[NoCoverage] ArrayDeclaration
src/lib/mock-data.ts:22:18
     name: 'Tel El Kebir District Hospital', 
     type: 'district_hospital', 
     location: 'Tel El Kebir',
-    departments: ['Emergency', 'ICU', 'Surgery', 'Internal Medicine', 'Pediatrics'],
+    departments: [],
     capacity: {
       ICU: { total: 8, occupied: 8 },

[NoCoverage] ObjectLiteral
src/lib/mock-data.ts:26:13
     capacity: {
       ICU: { total: 8, occupied: 8 },
       CCU: { total: 0, occupied: 0 },
-      PICU: { total: 0, occupied: 0 },
+      PICU: {},
       Ward: { total: 100, occupied: 85 }
     }

[NoCoverage] StringLiteral
src/lib/mock-data.ts:31:9
     }
   },
   { 
-    id: 'f3', 
+    id: "", 
     name: 'Qassasin District Hospital', 
     type: 'district_hospital', 

[NoCoverage] StringLiteral
src/lib/mock-data.ts:32:11
   },
   { 
     id: 'f3', 
-    name: 'Qassasin District Hospital', 
+    name: "", 
     type: 'district_hospital', 
     location: 'Qassasin',

[NoCoverage] StringLiteral
src/lib/mock-data.ts:33:11
   { 
     id: 'f3', 
     name: 'Qassasin District Hospital', 
-    type: 'district_hospital', 
+    type: "", 
     location: 'Qassasin',
     departments: ['Emergency', 'ICU', 'Surgery', 'Internal Medicine'],

[NoCoverage] StringLiteral
src/lib/mock-data.ts:35:32
     name: 'Qassasin District Hospital', 
     type: 'district_hospital', 
     location: 'Qassasin',
-    departments: ['Emergency', 'ICU', 'Surgery', 'Internal Medicine'],
+    departments: ['Emergency', "", 'Surgery', 'Internal Medicine'],
     capacity: {
       ICU: { total: 6, occupied: 4 },

[NoCoverage] ArrayDeclaration
src/lib/mock-data.ts:35:18
     name: 'Qassasin District Hospital', 
     type: 'district_hospital', 
     location: 'Qassasin',
-    departments: ['Emergency', 'ICU', 'Surgery', 'Internal Medicine'],
+    departments: [],
     capacity: {
       ICU: { total: 6, occupied: 4 },

[NoCoverage] ObjectLiteral
src/lib/mock-data.ts:40:13
       ICU: { total: 6, occupied: 4 },
       CCU: { total: 0, occupied: 0 },
       PICU: { total: 0, occupied: 0 },
-      Ward: { total: 80, occupied: 60 }
+      Ward: {}
     }
   },

[NoCoverage] StringLiteral
src/lib/mock-data.ts:48:19
     name: 'Fayed Primary Care Unit', 
     type: 'primary_care', 
     location: 'Fayed',
-    departments: ['Emergency', 'Outpatient'],
+    departments: ["", 'Outpatient'],
     capacity: {
       ICU: { total: 0, occupied: 0 },

[NoCoverage] ObjectLiteral
src/lib/mock-data.ts:50:12
     location: 'Fayed',
     departments: ['Emergency', 'Outpatient'],
     capacity: {
-      ICU: { total: 0, occupied: 0 },
+      ICU: {},
       CCU: { total: 0, occupied: 0 },
       PICU: { total: 0, occupied: 0 },

[NoCoverage] StringLiteral
src/lib/mock-data.ts:57:9
     }
   },
   { 
-    id: 'f5', 
+    id: "", 
     name: 'Abu Suwir Primary Care Unit', 
     type: 'primary_care', 

[NoCoverage] ArrayDeclaration
src/lib/mock-data.ts:61:18
     name: 'Abu Suwir Primary Care Unit', 
     type: 'primary_care', 
     location: 'Abu Suwir',
-    departments: ['Emergency', 'Outpatient'],
+    departments: [],
     capacity: {
       ICU: { total: 0, occupied: 0 },

[NoCoverage] ArrayDeclaration
src/lib/mock-data.ts:71:35
   },
 ];
 
-export const MOCK_USERS: User[] = [
-  { id: 'u0', name: 'Hassan (Owner)', email: 'hassan.abdelmenem@gmail.com', role: 'owner', phoneNumber: '+20 100 000 0000' },
-  { id: 'u_admin', name: 'System Admin', email: 'admin@ismailiahealth.gov', role: 'system_admin', phoneNumber: '+20 100 000 0001' },
-  { id: 'u1', name: 'Dr. Ahmed Youssef', email: 'ahmed.y@ismailiahealth.gov', role: 'medical_director', facilityId: 'f1', phoneNumber: '+20 120 123 4567' },
-  { id: 'u2', name: 'Dr. Sara Mahmoud', email: 'sara.m@ismailiahealth.gov', role: 'clinician', facilityId: 'f4', department: 'Emergency', phoneNumber: '+20 101 234 5678' },
-  { id: 'u3', name: 'Dr. Khaled Ibrahim', email: 'khaled.i@ismailiahealth.gov', role: 'head_of_department', facilityId: 'f1', department: 'Cardiology', phoneNumber: '+20 111 345 6789' },
-  { id: 'u4', name: 'Nrs. Fatima Ali', email: 'fatima.a@ismailiahealth.gov', role: 'nursing_supervisor', facilityId: 'f2', phoneNumber: '+20 155 456 7890' },
-  { id: 'u5', name: 'Dr. Tarek Hassan', email: 'tarek.h@ismailiahealth.gov', role: 'hospital_manager', facilityId: 'f1', phoneNumber: '+20 122 567 8901' },
-  { id: 'u6', name: 'ER Dispatch Team', email: 'er.f1@ismailiahealth.gov', role: 'er_room', facilityId: 'f1', phoneNumber: '+20 123 456 7890' },
-  { id: 'u7', name: 'ER Dispatch Team', email: 'er.f2@ismailiahealth.gov', role: 'er_room', facilityId: 'f2', phoneNumber: '+20 123 456 7891' },
-];
+export const MOCK_USERS: User[] = [];
 

[NoCoverage] StringLiteral
src/lib/mock-data.ts:72:83
 ];
 
 export const MOCK_USERS: User[] = [
-  { id: 'u0', name: 'Hassan (Owner)', email: 'hassan.abdelmenem@gmail.com', role: 'owner', phoneNumber: '+20 100 000 0000' },
+  { id: 'u0', name: 'Hassan (Owner)', email: 'hassan.abdelmenem@gmail.com', role: "", phoneNumber: '+20 100 000 0000' },
   { id: 'u_admin', name: 'System Admin', email: 'admin@ismailiahealth.gov', role: 'system_admin', phoneNumber: '+20 100 000 0001' },
   { id: 'u1', name: 'Dr. Ahmed Youssef', email: 'ahmed.y@ismailiahealth.gov', role: 'medical_director', facilityId: 'f1', phoneNumber: '+20 120 123 4567' },

[NoCoverage] StringLiteral
src/lib/mock-data.ts:73:49
 
 export const MOCK_USERS: User[] = [
   { id: 'u0', name: 'Hassan (Owner)', email: 'hassan.abdelmenem@gmail.com', role: 'owner', phoneNumber: '+20 100 000 0000' },
-  { id: 'u_admin', name: 'System Admin', email: 'admin@ismailiahealth.gov', role: 'system_admin', phoneNumber: '+20 100 000 0001' },
+  { id: 'u_admin', name: 'System Admin', email: "", role: 'system_admin', phoneNumber: '+20 100 000 0001' },
   { id: 'u1', name: 'Dr. Ahmed Youssef', email: 'ahmed.y@ismailiahealth.gov', role: 'medical_director', facilityId: 'f1', phoneNumber: '+20 120 123 4567' },
   { id: 'u2', name: 'Dr. Sara Mahmoud', email: 'sara.m@ismailiahealth.gov', role: 'clinician', facilityId: 'f4', department: 'Emergency', phoneNumber: '+20 101 234 5678' },

[NoCoverage] StringLiteral
src/lib/mock-data.ts:73:9
 
 export const MOCK_USERS: User[] = [
   { id: 'u0', name: 'Hassan (Owner)', email: 'hassan.abdelmenem@gmail.com', role: 'owner', phoneNumber: '+20 100 000 0000' },
-  { id: 'u_admin', name: 'System Admin', email: 'admin@ismailiahealth.gov', role: 'system_admin', phoneNumber: '+20 100 000 0001' },
+  { id: "", name: 'System Admin', email: 'admin@ismailiahealth.gov', role: 'system_admin', phoneNumber: '+20 100 000 0001' },
   { id: 'u1', name: 'Dr. Ahmed Youssef', email: 'ahmed.y@ismailiahealth.gov', role: 'medical_director', facilityId: 'f1', phoneNumber: '+20 120 123 4567' },
   { id: 'u2', name: 'Dr. Sara Mahmoud', email: 'sara.m@ismailiahealth.gov', role: 'clinician', facilityId: 'f4', department: 'Emergency', phoneNumber: '+20 101 234 5678' },

[NoCoverage] StringLiteral
src/lib/mock-data.ts:74:85
 export const MOCK_USERS: User[] = [
   { id: 'u0', name: 'Hassan (Owner)', email: 'hassan.abdelmenem@gmail.com', role: 'owner', phoneNumber: '+20 100 000 0000' },
   { id: 'u_admin', name: 'System Admin', email: 'admin@ismailiahealth.gov', role: 'system_admin', phoneNumber: '+20 100 000 0001' },
-  { id: 'u1', name: 'Dr. Ahmed Youssef', email: 'ahmed.y@ismailiahealth.gov', role: 'medical_director', facilityId: 'f1', phoneNumber: '+20 120 123 4567' },
+  { id: 'u1', name: 'Dr. Ahmed Youssef', email: 'ahmed.y@ismailiahealth.gov', role: "", facilityId: 'f1', phoneNumber: '+20 120 123 4567' },
   { id: 'u2', name: 'Dr. Sara Mahmoud', email: 'sara.m@ismailiahealth.gov', role: 'clinician', facilityId: 'f4', department: 'Emergency', phoneNumber: '+20 101 234 5678' },
   { id: 'u3', name: 'Dr. Khaled Ibrahim', email: 'khaled.i@ismailiahealth.gov', role: 'head_of_department', facilityId: 'f1', department: 'Cardiology', phoneNumber: '+20 111 345 6789' },

[NoCoverage] StringLiteral
src/lib/mock-data.ts:74:21
 export const MOCK_USERS: User[] = [
   { id: 'u0', name: 'Hassan (Owner)', email: 'hassan.abdelmenem@gmail.com', role: 'owner', phoneNumber: '+20 100 000 0000' },
   { id: 'u_admin', name: 'System Admin', email: 'admin@ismailiahealth.gov', role: 'system_admin', phoneNumber: '+20 100 000 0001' },
-  { id: 'u1', name: 'Dr. Ahmed Youssef', email: 'ahmed.y@ismailiahealth.gov', role: 'medical_director', facilityId: 'f1', phoneNumber: '+20 120 123 4567' },
+  { id: 'u1', name: "", email: 'ahmed.y@ismailiahealth.gov', role: 'medical_director', facilityId: 'f1', phoneNumber: '+20 120 123 4567' },
   { id: 'u2', name: 'Dr. Sara Mahmoud', email: 'sara.m@ismailiahealth.gov', role: 'clinician', facilityId: 'f4', department: 'Emergency', phoneNumber: '+20 101 234 5678' },
   { id: 'u3', name: 'Dr. Khaled Ibrahim', email: 'khaled.i@ismailiahealth.gov', role: 'head_of_department', facilityId: 'f1', department: 'Cardiology', phoneNumber: '+20 111 345 6789' },

[NoCoverage] StringLiteral
src/lib/mock-data.ts:75:152
   { id: 'u0', name: 'Hassan (Owner)', email: 'hassan.abdelmenem@gmail.com', role: 'owner', phoneNumber: '+20 100 000 0000' },
   { id: 'u_admin', name: 'System Admin', email: 'admin@ismailiahealth.gov', role: 'system_admin', phoneNumber: '+20 100 000 0001' },
   { id: 'u1', name: 'Dr. Ahmed Youssef', email: 'ahmed.y@ismailiahealth.gov', role: 'medical_director', facilityId: 'f1', phoneNumber: '+20 120 123 4567' },
-  { id: 'u2', name: 'Dr. Sara Mahmoud', email: 'sara.m@ismailiahealth.gov', role: 'clinician', facilityId: 'f4', department: 'Emergency', phoneNumber: '+20 101 234 5678' },
+  { id: 'u2', name: 'Dr. Sara Mahmoud', email: 'sara.m@ismailiahealth.gov', role: 'clinician', facilityId: 'f4', department: 'Emergency', phoneNumber: "" },
   { id: 'u3', name: 'Dr. Khaled Ibrahim', email: 'khaled.i@ismailiahealth.gov', role: 'head_of_department', facilityId: 'f1', department: 'Cardiology', phoneNumber: '+20 111 345 6789' },
   { id: 'u4', name: 'Nrs. Fatima Ali', email: 'fatima.a@ismailiahealth.gov', role: 'nursing_supervisor', facilityId: 'f2', phoneNumber: '+20 155 456 7890' },

[NoCoverage] StringLiteral
src/lib/mock-data.ts:76:87
   { id: 'u_admin', name: 'System Admin', email: 'admin@ismailiahealth.gov', role: 'system_admin', phoneNumber: '+20 100 000 0001' },
   { id: 'u1', name: 'Dr. Ahmed Youssef', email: 'ahmed.y@ismailiahealth.gov', role: 'medical_director', facilityId: 'f1', phoneNumber: '+20 120 123 4567' },
   { id: 'u2', name: 'Dr. Sara Mahmoud', email: 'sara.m@ismailiahealth.gov', role: 'clinician', facilityId: 'f4', department: 'Emergency', phoneNumber: '+20 101 234 5678' },
-  { id: 'u3', name: 'Dr. Khaled Ibrahim', email: 'khaled.i@ismailiahealth.gov', role: 'head_of_department', facilityId: 'f1', department: 'Cardiology', phoneNumber: '+20 111 345 6789' },
+  { id: 'u3', name: 'Dr. Khaled Ibrahim', email: 'khaled.i@ismailiahealth.gov', role: "", facilityId: 'f1', department: 'Cardiology', phoneNumber: '+20 111 345 6789' },
   { id: 'u4', name: 'Nrs. Fatima Ali', email: 'fatima.a@ismailiahealth.gov', role: 'nursing_supervisor', facilityId: 'f2', phoneNumber: '+20 155 456 7890' },
   { id: 'u5', name: 'Dr. Tarek Hassan', email: 'tarek.h@ismailiahealth.gov', role: 'hospital_manager', facilityId: 'f1', phoneNumber: '+20 122 567 8901' },

[NoCoverage] ObjectLiteral
src/lib/mock-data.ts:77:3
   { id: 'u1', name: 'Dr. Ahmed Youssef', email: 'ahmed.y@ismailiahealth.gov', role: 'medical_director', facilityId: 'f1', phoneNumber: '+20 120 123 4567' },
   { id: 'u2', name: 'Dr. Sara Mahmoud', email: 'sara.m@ismailiahealth.gov', role: 'clinician', facilityId: 'f4', department: 'Emergency', phoneNumber: '+20 101 234 5678' },
   { id: 'u3', name: 'Dr. Khaled Ibrahim', email: 'khaled.i@ismailiahealth.gov', role: 'head_of_department', facilityId: 'f1', department: 'Cardiology', phoneNumber: '+20 111 345 6789' },
-  { id: 'u4', name: 'Nrs. Fatima Ali', email: 'fatima.a@ismailiahealth.gov', role: 'nursing_supervisor', facilityId: 'f2', phoneNumber: '+20 155 456 7890' },
+  {},
   { id: 'u5', name: 'Dr. Tarek Hassan', email: 'tarek.h@ismailiahealth.gov', role: 'hospital_manager', facilityId: 'f1', phoneNumber: '+20 122 567 8901' },
   { id: 'u6', name: 'ER Dispatch Team', email: 'er.f1@ismailiahealth.gov', role: 'er_room', facilityId: 'f1', phoneNumber: '+20 123 456 7890' },

[NoCoverage] StringLiteral
src/lib/mock-data.ts:77:84
   { id: 'u1', name: 'Dr. Ahmed Youssef', email: 'ahmed.y@ismailiahealth.gov', role: 'medical_director', facilityId: 'f1', phoneNumber: '+20 120 123 4567' },
   { id: 'u2', name: 'Dr. Sara Mahmoud', email: 'sara.m@ismailiahealth.gov', role: 'clinician', facilityId: 'f4', department: 'Emergency', phoneNumber: '+20 101 234 5678' },
   { id: 'u3', name: 'Dr. Khaled Ibrahim', email: 'khaled.i@ismailiahealth.gov', role: 'head_of_department', facilityId: 'f1', department: 'Cardiology', phoneNumber: '+20 111 345 6789' },
-  { id: 'u4', name: 'Nrs. Fatima Ali', email: 'fatima.a@ismailiahealth.gov', role: 'nursing_supervisor', facilityId: 'f2', phoneNumber: '+20 155 456 7890' },
+  { id: 'u4', name: 'Nrs. Fatima Ali', email: 'fatima.a@ismailiahealth.gov', role: "", facilityId: 'f2', phoneNumber: '+20 155 456 7890' },
   { id: 'u5', name: 'Dr. Tarek Hassan', email: 'tarek.h@ismailiahealth.gov', role: 'hospital_manager', facilityId: 'f1', phoneNumber: '+20 122 567 8901' },
   { id: 'u6', name: 'ER Dispatch Team', email: 'er.f1@ismailiahealth.gov', role: 'er_room', facilityId: 'f1', phoneNumber: '+20 123 456 7890' },

[NoCoverage] ObjectLiteral
src/lib/mock-data.ts:79:3
   { id: 'u3', name: 'Dr. Khaled Ibrahim', email: 'khaled.i@ismailiahealth.gov', role: 'head_of_department', facilityId: 'f1', department: 'Cardiology', phoneNumber: '+20 111 345 6789' },
   { id: 'u4', name: 'Nrs. Fatima Ali', email: 'fatima.a@ismailiahealth.gov', role: 'nursing_supervisor', facilityId: 'f2', phoneNumber: '+20 155 456 7890' },
   { id: 'u5', name: 'Dr. Tarek Hassan', email: 'tarek.h@ismailiahealth.gov', role: 'hospital_manager', facilityId: 'f1', phoneNumber: '+20 122 567 8901' },
-  { id: 'u6', name: 'ER Dispatch Team', email: 'er.f1@ismailiahealth.gov', role: 'er_room', facilityId: 'f1', phoneNumber: '+20 123 456 7890' },
+  {},
   { id: 'u7', name: 'ER Dispatch Team', email: 'er.f2@ismailiahealth.gov', role: 'er_room', facilityId: 'f2', phoneNumber: '+20 123 456 7891' },
 ];

[NoCoverage] StringLiteral
src/lib/mock-data.ts:80:82
   { id: 'u4', name: 'Nrs. Fatima Ali', email: 'fatima.a@ismailiahealth.gov', role: 'nursing_supervisor', facilityId: 'f2', phoneNumber: '+20 155 456 7890' },
   { id: 'u5', name: 'Dr. Tarek Hassan', email: 'tarek.h@ismailiahealth.gov', role: 'hospital_manager', facilityId: 'f1', phoneNumber: '+20 122 567 8901' },
   { id: 'u6', name: 'ER Dispatch Team', email: 'er.f1@ismailiahealth.gov', role: 'er_room', facilityId: 'f1', phoneNumber: '+20 123 456 7890' },
-  { id: 'u7', name: 'ER Dispatch Team', email: 'er.f2@ismailiahealth.gov', role: 'er_room', facilityId: 'f2', phoneNumber: '+20 123 456 7891' },
+  { id: 'u7', name: 'ER Dispatch Team', email: 'er.f2@ismailiahealth.gov', role: "", facilityId: 'f2', phoneNumber: '+20 123 456 7891' },
 ];
 
